{
<<<<<<< HEAD
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 128,
=======
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
>>>>>>> c4c918e (samir)
  "id2label": {
    "0": "O",
    "1": "B-aliases",
    "2": "I-aliases",
    "3": "B-app_name",
    "4": "I-app_name",
    "5": "B-container_amount",
    "6": "I-container_amount",
    "7": "B-container_name",
    "8": "I-container_name",
    "9": "B-container_size",
    "10": "I-container_size",
    "11": "B-filter",
    "12": "I-filter",
    "13": "B-git_ref",
    "14": "I-git_ref",
    "15": "B-github_repo",
    "16": "I-github_repo",
    "17": "B-n",
    "18": "I-n",
    "19": "B-new_name",
    "20": "I-new_name",
    "21": "B-region",
    "22": "I-region",
    "23": "B-scope",
    "24": "I-scope",
    "25": "B-variable_name",
    "26": "I-variable_name",
    "27": "B-variable_value",
    "28": "I-variable_value"
  },
  "initializer_range": 0.02,
<<<<<<< HEAD
  "intermediate_size": 512,
=======
>>>>>>> c4c918e (samir)
  "label2id": {
    "B-aliases": 1,
    "B-app_name": 3,
    "B-container_amount": 5,
    "B-container_name": 7,
    "B-container_size": 9,
    "B-filter": 11,
    "B-git_ref": 13,
    "B-github_repo": 15,
    "B-n": 17,
    "B-new_name": 19,
    "B-region": 21,
    "B-scope": 23,
    "B-variable_name": 25,
    "B-variable_value": 27,
    "I-aliases": 2,
    "I-app_name": 4,
    "I-container_amount": 6,
    "I-container_name": 8,
    "I-container_size": 10,
    "I-filter": 12,
    "I-git_ref": 14,
    "I-github_repo": 16,
    "I-n": 18,
    "I-new_name": 20,
    "I-region": 22,
    "I-scope": 24,
    "I-variable_name": 26,
    "I-variable_value": 28,
    "O": 0
  },
<<<<<<< HEAD
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 2,
  "num_hidden_layers": 2,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.6",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
=======
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.6",
  "vocab_size": 119547
>>>>>>> c4c918e (samir)
}
